###########
#
# Transliterate v-0.3 by Deltal
#
###########


def createTab(intab, outtab):
    replace = {}
    for i, sym in enumerate(intab):
        replace[sym] = outtab[i]
    return replace


def encode(tab, txt):
    re = str()
    did = False
    for sym in txt:
        for fr, to in tab.items():
            if sym == fr:
                re += to
                did = True
        if not did:
            re += sym
        did = False
    return re


tabs = {
    'rusToLatin': {'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e',
    	'ё': 'yo', 'ж': 'zh', 'з': 'z', 'и': 'i', 'й': 'y', 'к': 'k', 'л': 'l',
    	'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't',
    	'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'ts', 'ч': 'ch', 'ш': 'sh', 'щ': 'sch',
        'ъ': 'y', 'ы': 'i', 'ь': '', 'э': 'e', 'ю': 'yu', 'я': 'ya', 'А': 'A',
        'Б': 'B', 'В': 'V', 'Г': 'G', 'Д': 'D', 'Е': 'E', 'Ё': 'Yo', 'Ж': 'Zh',
        'З': 'Z', 'И': 'I', 'Й': 'Y', 'К': 'K', 'Л': 'L', 'М': 'M', 'Н': 'N',
        'О': 'O', 'П': 'P', 'Р': 'R', 'С': 'S', 'Т': 'T', 'У': 'U', 'Ф': 'F',
        'Х': 'H', 'Ц': 'Ts', 'Ч': 'Ch', 'Ш': 'SH', 'Щ': 'Sch', 'Ъ': '', 'Ы': 'I',
        'Ь': '`', 'Э': 'E', 'Ю': 'Yu', 'Я': 'Ya'},
    'russianLeet': {'а': '4', 'б': '6', 'в': '8', 'г': '2', 'д': '-^-', 'е': '9',
   		'ё': '9', 'ж': '>/<', 'з': '3', 'и': 'I/I', 'к': 'I<', 'л': '/I', 'м': 'IvI',
    	'н': 'I-I', 'о': '0', 'п': 'I`I', 'р': '|*', 'с': '<', 'т': '7', 'у': '`/',
    	'ф':'%','х':'><','ц':'u,','ч':'^I','ш':'iii','щ':'iii,','ъ':'7o','ы':'IoI',
    	'ь':'/o','э':'->','ю':'i-o','я':'9I','А': '4', 'Б': '6', 'В': '8', 'Г': '2', 'Д': '-^-', 'Е': '9',
   		'Ё': '9', 'Ж': '>/<', 'З': '3', 'И': 'I/I', 'К': 'I<', 'Л': '/I', 'М': 'IVI',
    	'Н': 'I-I', 'О': '0', 'П': 'I`I', 'Р': '|*', 'С': '<', 'Т': '7', 'У': '`/',
    	'Ф':'%','Х':'><','Ц':'U,','Ч':'^I','Ш':'III','Щ':'III,','Ъ':'7O','Ы':'IOI',
    	'Ь':'/O','Э':'->','Ю':'I-O','Я':'9I'}
}
